zdyz-stm32f429-board/gpio/user/main.c
/**
  ******************************************************************************
  * @file        : main.c
  * @author      : ZJY
  * @version     : V1.0
  * @date        : 2024-09-26
  * @brief       : Main program body
  * @attention   : None
  ******************************************************************************
  * @history     :
  *         V1.0 : 1.xxx
  *
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "board.h"
#include "gpio.h"

#include "stimer.h"
#include "key.h"

#if defined(SOC_SERIES_STM32F1)
    #include "stm32f1xx.h"
#elif defined(SOC_SERIES_STM32F4)
    #include "stm32f4xx.h"
#elif defined(SOC_SERIES_STM32G4)
    #include "stm32g4xx.h"
#else
#error "Please select first the soc series used in your application!"    
#endif

#include <stdio.h>
#include <assert.h>

#define  LOG_TAG             "main"
#define  LOG_LVL             4
#include "log.h"

#include "stm32_flash.h"
#include "mtd_core.h"
#include <string.h>
/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
size_t pin_id = 0;

uint8_t r_buf[16];
uint8_t w_buf[16] = "hello nihao!";
uint8_t w1_buf[16] = "shabi wanyi!";
/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void)
{   
    board_init();
    
    pin_id = gpio_get("PB.0");
    
    /* set led gpio mode */
    gpio_set_mode(LED_RED_PIN_ID, PIN_OUTPUT_PP, PIN_PULL_UP);
    gpio_set_mode(LED_BLUE_PIN_ID, PIN_OUTPUT_PP, PIN_PULL_UP);
    gpio_write(LED_RED_PIN_ID, 0);
    gpio_write(LED_BLUE_PIN_ID, 0);
    
    LOG_D("Init success!\r\n");
    LOG_W("LOG_LVL_WARNING success!\r\n");
    LOG_E("LOG_LVL_ERROR success!\r\n");
    
    mtd_read(&stm32_flash_info, 0, 16, r_buf);
    LOG_D("r_buf = %s\r\n", r_buf);
    
    mtd_write(&stm32_flash_info, 0, 16, w1_buf);
    mtd_read(&stm32_flash_info, 0, 16, r_buf);
    LOG_D("r_buf = %s\r\n", r_buf);
    
    mtd_erase(&stm32_flash_info, 0, 16, NULL);
    mtd_write(&stm32_flash_info, 0, 16, w_buf);
    memset(r_buf, 0x00, 16);
    mtd_read(&stm32_flash_info, 0, 16, r_buf);
    LOG_D("r_buf = %s\r\n", r_buf);
    
    while (1)
    {
        key_event_msg_t msg;
        
        stimer_service();
        
        if (key_get_event(&msg))
        {
            LOG_D("key_id = %d, key_event = %d\r\n", msg.id, msg.event);
        }
    }
}
